Revit 2027 API
RevitLinkOptions Properties
The RevitLinkOptions type exposes the following members.
Properties
Name | Description
IsRelative |  The type of path to use when creating the link. If true, Revit will store a relative path for the link. If false, Revit will store an absolute path. If the link is to a Revit Server location, isRelative must be false.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
RevitLinkOptions Class
Autodesk.Revit.DB Namespace